[CLS]
[SEP]
[MASK]
[UNK]
[PAD]
[unused1]
[unused2]
[unused3]
[unused4]
[unused5]
[unused6]
[unused7]
[unused8]
[unused9]
[unused10]
[unused11]
[unused12]
[unused13]
[unused14]
[unused15]
[unused16]
[unused17]
[unused18]
[unused19]
[unused20]
79
2
4
208
,
370
1327
1372
121
49276
294
1278
1270
6937
1279
’
4991
1275
180
183
5412
1067
106
451
177
449
374
194
909
1938
5883
1292
233
–
128
60
1363
582
1679
14
24789
1099
5608
2022
1844
6977
1802
:
559
2575
172
565
2012
1420
2149
2079
2080
84
10998
17959
23
775
2249
2700
62
11
2737
1584
2018
119
690
112
4235
9889
1123
3200
1167
2649
44
102
61
673
4247
619
574
98
'
141
26
4317
5432
2526
43635
1172
5890
37814
221
38342
5864
493
3056
5845
4092
3336
4401
10548
2494
3437
19323
8904
331
4528
8378
309
6995
-
649
17799
9893
9894
14482
2759
6238
9983
1384
9588
10886
110
2341
9569
6250
1094
11858
2168
1021
11768
12871
480
12861
4584
3347
4163
78
8
4935
13128
3435
6
19736
591
14420
17
2380
6979
17057
20
1488
12843
5489
187
14329
2180
15808
36
15
3032
14351
275
10289
8699
1009
4159
10390
14250
4178
7829
3828
9627
17756
1746
387
17739
17740
780
181
1881
771
11262
6843
322
11116
349
4891
12535
4281
37167
2843
2220
14210
10604
9663
788
19671
18193
629
1322
444
71
1548
633
18366
11770
11865
4843
4860
154
907
2664
3035
255
585
7983
96
14154
6249
330
2552
4602
19412
19397
19398
51
1291
1267
1334
28
4326
5619
247
83
6873
139
6118
1191
12497
6069
8401
2612
1466
22265
22266
732
1866
363
22268
5832
563
1901
5717
1459
1154
1304
472
245
?
4813
9225
9226
6654
.
264
69
3819
12
4274
464
12590
35
6563
2250
5098
293
863
6894
23556
1068
$
23609
7779
12364
3730
316
7495
123
23773
2173
6247
12493
2223
4344
26703
1500
19944
4278
195
4899
3011
483
257
8012
5067
12221
1134
6157
38718
104
£
510
30
148
1355
15150
4531
14189
3781
6344
3424
2166
2520
3974
6142
3987
5245
15575
162
622
17490
4147
4195
5143
1714
13126
4846
41661
434
33241
28408
410
5199
5080
8941
75
6801
1301
16595
4307
16393
27966
2205
34897
5600
1193
1047
2372
1839
5125
671
31956
531
2229
1383
3380
5283
25677
5132
1757
3712
853
149
703
2252
1885
3504
34521
38672
3254
1907
466
77
4694
19740
5027
1852
3585
39463
103
105
‘
23571
13869
1571
152
5421
2583
2335
562
342
32
24329
6963
4403
4715
11117
5786
40349
860
2954
4501
2992
1261
12780
21637
359
4221
7257
43046
1272
1006
1310
517
1189
1552
25664
424
1365
15495
10576
6512
25261
2509
2060
5346
3443
18104
13788
2806
5233
10351
776
1671
29391
753
2174
364
453
2172
133
9900
2030
1401
6943
39284
18781
31278
276
589
4696
42425
956
1038
6465
24044
3716
20891
1663
34162
835
3575
2324
397
910
4830
5857
1298
7864
7647
26068
10412
1227
13625
2156
46
200
41371
16619
11149
5282
249
23696
9251
2624
14384
4428
6176
5827
17567
425
35134
1644
4000
4688
13462
48357
4354
4279
143
256
3968
17850
45
22
6488
319
1838
215
4347
6987
2641
38160
45751
1415
24483
5773
4499
4913
2665
1439
100
250
15555
4007
2002
5093
2592
31
7209
1727
49189
1312
10072
11442
|
5539
27130
5985
5679
2320
541
34901
9976
38033
2768
3257
2507
53
23712
...
758
38088
4144
38325
9369
11278
12621
€
™
7776
1851
32107
˜
2003
6951
710
5554
10322
308
4437
14968
38471
280
1805
14602
761
2331
3709
24517
2004
1050
22439
2295
3077
317
1375
53227
34730
2063
23708
14610
4994
54122
179
7726
19677
4847
4260
15819
9499
!
9310
18988
20444
6533
5156
2633
2046
2549
1859
2856
52
281
34822
17250
22359
962
279
375
30749
9565
51259
881
681
24441
38908
9949
6415
2718
2634
1436
14470
26002
10806
24279
5494
28592
28593
4133
1795
427
13024
25605
10913
1774
19564
10090
9356
3030
13172
5766
4713
1369
344
1582
327
18547
6529
6962
5018
15089
3836
1129
7550
62120
4555
1908
6468
12290
16680
1057
296
1412
9207
3705
3123
34273
21566
155
533
28500
11923
535
8622
5984
3782
3008
2291
2294
3494
9661
2315
63800
12650
12429
9151
1164
2810
32172
2487
1778
33667
13051
9891
3210
3153
64751
5058
3129
58216
597
18986
5779
4962
625
3717
8528
2498
12996
20084
793
1318
36516
1928
244
366
315
432
18403
379
46009
18648
2411
1039
2880
10785
2286
5126
26099
3945
1269
11052
3648
61371
4436
2489
8430
6184
6428
116
117
4126
3155
156
15482
56894
3255
2148
5712
3685
739
19027
2553
4200
19
16
24547
722
11733
67685
185
67743
6083
5875
3280
26532
26086
8245
14643
291
17097
35260
47892
35788
7417
40995
10449
6200
14667
8751
3086
1777
2796
2492
12778
2469
1990
23949
10146
2451
7080
11899
5020
6245
13404
2034
8486
1475
1353
5081
2171
6046
5097
412
3509
1240
5685
3190
13034
9828
901
1253
70934
5760
20860
4198
11068
312
16262
3340
17292
14395
4857
42493
5244
2261
3467
5718
75150
23546
71128
24256
468
2485
22467
1516
5940
3590
6220
470
125
11115
2943
1662
19244
18923
19149
10504
72616
2447
2977
8901
182
2425
8362
23751
16573
9500
4464
1293
2497
62373
13809
98249
416
1460
38002
5872
72331
972
2014
22347
4671
4315
45774
13551
2459
31393
8520
6453
9197
20410
10049
1561
4047
1065
651
2347
1115
945
10738
3159
1305
1328
3357
19082
11766
20384
29135
15717
865
3640
39
46392
3521
502
2257
34121
1295
31832
2198
25280
6732
348
7278
9034
336
7708
20790
6648
23487
1071
5884
74244
816
21708
13385
4389
19232
62782
1430
129
4438
7966
5666
3216
286
1385
2358
7156
7567
697
7256
19392
17871
21512
1659
491
13831
1678
17897
63869
58
1557
6723
24337
3344
896
18766
5915
90070
8854
2081
14201
21697
21935
82
35901
5010
13799
26344
77637
904
9363
3327
13030
17192
18178
226
19465
5859
22313
50237
4306
3318
6587
460
25580
39342
48946
13422
28533
2215
31874
1980
318
5505
300
14364
1933
2078
2548
125720
1069
2366
8860
27493
31822
10195
15845
13341
5751
1701
1097
406
802
22922
45702
2698
10826
1508
13285
4179
20927
130
1510
1399
1294
6645
1074
1018
1011
7111
2044
17499
3451
10565
1072
4672
873
34748
22711
1053
6803
13548
2561
1408
14077
136
5876
7960
5510
4228
43810
27019
12300
2015
2660
530
14486
11179
7107
6318
5570
3563
4867
28033
10917
5709
2420
3426
528
911
5860
4903
346
48808
4141
3522
9268
6006
3326
9678
2897
2632
9526
9446
3311
30772
1577
1606
4016
14936
14365
43558
5320
439
5200
35878
13552
577
5066
23250
6960
49182
941
3091
19441
…
2370
9882
17520
7839
3909
1116
27640
12118
22049
354
184
7203
59637
15668
3150
14935
2919
259
5429
19292
39403
36588
2151
193
3468
2591
297
506
1382
3516
7732
64777
25992
981
90260
13836
13813
4628
8287
2901
13229
1392
30480
3406
1396
2192
--
6500
3519
58722
1055
48733
6573
3986
16155
7212
545
738
15478
44281
7198
41
39091
33798
4114
852
8291
705
2517
7638
5716
440
2564
854
728
1173
4165
6211
1314
4587
3666
15867
88073
35968
16650
20588
3593
19767
42642
1977
3693
13383
9432
93437
6886
5641
4180
1698
16268
16344
77061
9097
10831
21450
23167
2795
1029
614
9974
953
26382
262
872
4669
9473
240
12395
30823
8610
34677
1374
5272
8602
54069
4250
35846
8902
1997
6650
10755
13993
314
5881
2277
18108
2476
71203
7183
10639
50460
8156
1388
122
5239
11192
13
4245
10612
50850
14513
6442
13523
6866
3902
19790
13962
5681
3295
9442
14590
44815
24110
6418
3655
2829
475
54571
31709
12230
746
25863
2008
1626
20854
19913
538
477
5885
41299
3088
5151
11647
20348
12682
10756
4261
18844
5529
12502
3743
14062
1281
4083
11605
976
6218
43453
1476
4370
20328
8875
7442
4673
10221
616
3022
29559
45714
4610
16740
2110
18469
29087
10522
287
11385
18247
8154
105399
8147
105400
1699
509
15240
15566
11946
685
974
3352
1770
750
20089
105732
14730
18793
485
508
50765
2369
704
40414
7049
2691
13221
7285
2227
12734
11902
3000
5871
26094
9319
9887
36886
1752
4335
9507
4424
105950
1911
7700
15295
6038
1767
26831
3610
4650
20007
27189
1282
5588
5927
17741
8629
2383
1828
13550
9605
700
19936
33832
106872
7271
1235
12113
6559
27612
5661
178
1643
719
438
24918
25111
1687
2735
1256
23264
8722
39351
114
23626
8197
80868
88316
7933
3419
21282
18257
9703
3621
5248
4796
7689
12042
15737
5052
307
62927
5931
26480
919
9202
5858
4836
3208
1946
65372
786
15814
1111
33367
1735
1343
21899
2133
8483
5784
3975
23483
1599
341
2019
4098
4286
353
3588
7646
3109
1339
479
10182
3732
940
927
12646
22132
4556
1958
10187
109433
3600
3574
6486
5478
29419
88192
19765
24486
2137
7026
47430
2616
9705
5087
55868
16355
12897
1341
1461
10951
1897
10026
11633
11813
2892
3734
6028
8662
3808
13835
12708
870
4397
21624
6794
71317
3554
4988
16677
5036
4842
1720
12543
3090
2962
2532
7113
33838
5530
961
5849
38744
1718
9469
2412
18429
846
686
5496
997
19514
19515
24664
12980
18470
116794
5964
2422
20025
4569
3471
1535
2528
1141
11121
11122
11750
6602
6603
4120
5274
23752
267
1364
27221
6199
20370
26419
1526
11919
5259
34066
20505
24081
2951
3527
68439
2562
9155
12177
7337
41935
32208
6940
4467
8661
3864
10071
4909
4320
21064
725
1797
16468
81298
4325
13088
16870
9083
9084
26110
4803
7178
351
10058
2994
3651
2991
536
44229
12900
11204
1222
2231
26421
19219
4151
7756
4529
18750
24748
3982
4778
3027
4776
748
21631
22405
46835
7374
121649
121650
159
1711
14004
88329
10531
110765
2522
4695
5645
3524
9760
9049
7039
6068
22006
9306
76834
13217
49983
5848
4432
527
9668
21691
86
15068
9821
62513
18206
3316
12476
3262
93673
6877
111382
14288
3847
9343
16565
4546
33458
6536
551
6234
7357
4257
1077
9276
7655
3865
12849
3957
17825
5878
134
27671
11499
5759
4030
1478
7284
26500
9368
19937
3603
14559
22626
1351
11526
6664
18814
14225
8279
1794
39106
10175
25255
7157
16827
5806
3322
5802
2204
3920
1695
2293
76352
63955
2506
3253
1264
11988
2232
3779
2814
7142
128140
57371
52557
7054
9198
26498
3342
33861
36427
883
1602
10132
18243
18244
7723
105455
2262
7738
129664
3994
6582
1696
2946
35966
34217
3787
9142
25679
8928
33373
63240
38667
733
42840
20518
26710
74516
110104
1572
1000
1076
1827
5260
2906
2993
2199
17226
57125
5763
557
16728
10331
25942
2912
368
75276
9288
3014
12064
1434
3714
2398
21507
6604
13502
3802
22318
1357
9435
57442
2606
24497
47431
54931
47083
137008
1716
5551
920
13373
5788
1527
340
13235
13266
27540
211
29767
29488
17164
1455
24113
1085
4226
17148
30857
2746
488
44282
2387
1325
443
2256
28890
15721
5294
13711
34903
83572
15767
19354
18261
10088
3364
6671
2570
2771
4624
4386
834
40301
61930
3608
1945
2334
10378
13062
5191
4562
18693
858
2704
790
15039
2840
4757
27406
15960
28147
42738
5898
32019
79672
2221
1117
88031
1902
388
12634
108994
1426
9018
24250
696
2726
18666
8811
4275
2028
20684
2303
1262
11552
51191
63504
7418
210
3051
3510
10878
936
1195
15722
3236
4866
3425
3566
9822
6849
22845
6869
3377
6709
14703
8152
10113
96660
1504
2825
1598
12909
9715
12185
1952
25513
97654
3232
3877
10448
15550
3393
9704
18833
4384
29159
19921
5490
3222
13464
22432
2382
1987
5250
144
13825
36443
5375
1878
9572
3427
5782
12110
2745
4017
6772
23001
20899
30304
6406
819
11363
3950
751
2681
5470
20423
3383
1469
1201
14762
1925
5660
1512
36006
2693
2047
1955
248
2442
1515
25053
4833
3983
5206
10445
708
394
7599
764
13702
13751
17303
13797
22605
24923
747
9271
13070
716
10302
5357
11484
29055
3458
9466
153408
32930
17851
8925
18752
42370
5381
10177
13941
2070
18433
5085
14600
46299
18190
465
1102
876
43965
26627
105418
4064
68147
6718
1808
3460
9574
471
25705
92320
5204
3470
5894
1966
8829
380
1806
13248
866
243
2029
26323
1899
10704
3649
1198
4705
390
2159
3606
9118
20750
5624
2615
59301
12629
1761
18654
23402
11477
4392
13647
11716
367
1565
13533
8945
11852
1140
93
15670
32272
10004
8326
720
1155
24617
22306
1319
131
3018
17125
7259
34035
219
445
3670
1402
950
18749
64754
5046
49936
6876
952
16033
23158
77291
35407
10518
7810
782
6812
19992
20342
48321
3956
34062
1666
10515
18574
19972
1251
11625
23031
241
3682
30299
20523
21162
2348
2253
939
16043
4234
14286
27127
6235
22323
40651
31661
26162
14663
1257
10282
3576
%
5929
16092
15904
1040
23538
4934
56404
18557
2500
14282
1496
7114
14233
1393
4132
8441
5520
3076
6009
3966
28243
2106
93682
14115
3541
7244
6004
3695
20087
4380
4518
228
28421
3025
592
4792
10729
8525
15769
30584
34661
13687
69721
38990
15256
3788
7510
1953
6580
2102
13121
53992
16645
1744
6885
14450
15183
14591
7437
14324
8342
2041
1930
27308
12134
40843
1731
6205
17059
21415
1225
3343
22781
20381
33761
27535
20629
5392
12870
402
6807
2375
7469
2580
1422
2920
3592
1218
2872
2100
46225
7604
23184
2684
25747
5540
24852
1358
885
609
4917
2305
147374
11270
1986
6530
413
1390
33402
3174
1917
42124
2547
1840
1188
63
10040
21056
19655
36705
18457
18458
5094
18452
18251
7353
3891
17074
12705
2069
1836
906
8351
28702
3883
2241
4837
3875
2154
31490
1819
1594
4677
4129
8141
29771
14177
19105
6729
985
9956
15487
5166
17742
4081
20885
2774
3289
1124
3791
31939
30325
7670
9161
5136
50087
1869
;
3345
8126
126010
6524
8167
951
8243
2394
11909
682
3381
1915
6186
13442
6613
19352
9809
20694
10415
7746
2573
3361
8531
16352
794
19056
1949
10097
957
34218
62694
68883
5405
2979
1842
17700
5522
3671
6689
9260
3531
5521
3298
111
20774
13150
3646
4754
10160
17378
1670
441
12860
11332
513
5480
108253
5562
126327
4153
5157
36855
83326
216
222
17844
8897
14713
4350
9916
376
51439
18541
68937
18765
41295
3654
180051
20331
1042
18544
38177
8387
736
5680
2932
2093
4474
4404
8823
5299
7341
2942
2839
2518
57587
70702
29922
7380
11773
11027
10380
15284
2050
13509
15049
8566
18208
4493
2787
33937
8034
6972
19510
5045
1106
2645
22684
17704
992
4678
2811
12913
7867
627
4457
10329
749
26504
4266
1523
32830
88275
2674
38892
6188
16460
12373
1522
11726
1340
8559
16021
12307
28638
10952
2458
7707
9751
825
76
13258
4850
14967
5213
18492
29435
9461
9547
35424
1001
14484
1093
8184
27330
168
6437
8230
52365
2569
183021
9716
1668
277
12065
900
8500
9109
2510
5844
6513
19128
74747
3211
12676
227
87618
10745
4719
4740
5427
2784
3857
15372
326
39565
31926
4811
437
2455
1202
40608
1387
1307
500
806
1146
12586
35598
"
25492
2557
3634
12546
2947
2618
18729
3050
5707
5498
2129
3197
13431
59882
92521
6748
6716
2505
14523
5854
16149
4806
6284
1751
1346
4645
62238
34
15081
50060
2536
34076
6464
9840
101909
18804
5851
3831
58702
3885
339
39939
1832
4013
(
4088
)
13395
6408
10511
28743
10036
6804
13083
12116
191
5525
15760
3240
6135
2123
647
6763
38880
1568
48129
522
10317
42687
22113
768
14811
7182
32008
11997
688
3989
19603
5000
8428
1406
28143
6136
13247
177125
6925
54816
13593
2170
53368
971
969
8579
3692
23737
27954
383
305
9047
6592
1283
4536
36386
2114
21053
17468
4568
1823
4517
2519
1109
18301
9757
24410
2353
3901
3146
51927
19189
39837
32934
878
11457
4167
7657
3631
9579
98409
14767
1537
55438
8526
24119
10365
8471
23842
2885
34465
1302
1303
3793
23247
1331
9169
29449
12213
8503
14672
59390
68365
7678
21849
2808
3184
9275
4460
8947
9781
117678
12188
12515
26515
127160
21
62833
62730
1017
1876
61417
7515
49733
10957
61964
26625
6694
14834
24534
5175
11565
859
19835
2182
2974
14704
5340
20327
1864
284
13491
5110
1540
10965
36861
4124
2830
9849
12158
48054
1043
5287
69143
33
10739
638
9297
2147
8770
68575
16331
16356
12504
48486
25
914
28897
49108
8993
2355
3203
12941
102178
13200
2765
549
6509
8861
4977
13537
9597
7445
2736
12847
14157
1688
6373
6034
4929
6345
10529
645
8511
5128
25042
34313
13886
56060
2246
19715
15008
19429
22881
4405
12130
8780
656
19469
22530
3432
15386
6282
10327
65821
8457
6020
6832
913
64603
7607
4497
20100
214
1704
40
34245
855
19750
17624
1389
21997
3334
2098
4361
3870
37704
20349
11845
3537
8708
2260
59246
14639
28503
1398
8968
1215
6033
15214
150309
3037
3826
14406
32468
2971
33619
674
6598
174
5482
395
1143
10922
1792
829
18464
16374
14029
10852
33326
12832
6053
60309
10665
3848
15715
20718
3423
27319
4073
1371
32528
4231
42537
49772
1887
1786
6976
1661
43506
3302
4810
17766
11819
5956
57719
17458
2593
16871
821
74429
55575
701
13913
11194
9644
769
17384
1137
8095
1175
3422
10536
6098
46461
26457
24823
18263
1487
11981
75148
2523
14416
10121
6295
11449
56401
20377
2584
1205
5194
2750
2364
209
8974
8975
623
20481
132
17660
31267
10935
11802
219777
44159
419
38097
6499
16121
14240
25332
24122
11958
6907
8970
1730
613
11917
9839
5541
5149
11232
24084
18442
12896
4925
26278
7774
8142
11986
24568
13671
30543
43416
7381
73366
29079
10130
4760
56722
6222
921
13282
5096
18281
32275
7128
6421
17566
92148
1409
5403
10728
24366
63710
63354
17141
2663
12967
11948
5682
699
653
43380
2831
978
1064
596
2714
18806
1801
103769
8071
10809
16364
4774
2715
26552
26028
467
3700
16291
15671
37172
831
4601
2760
16693
48352
1174
15464
2486
684
7001
10593
10594
7096
98047
2929
4025
13988
24977
4012
2903
2905
17962
9022
1627
15792
4879
6544
8588
13860
9081
56257
2095
875
1505
5504
2734
253
11568
11843
11604
4462
41639
822
20383
6992
1562
19660
4058
754
10671
33755
6959
6265
1570
2871
3599
7582
1080
10442
7449
1935
2944
1764
2254
53730
11513
17392
3446
5169
3144
11523
43
3523
2065
14274
16551
118
84667
2300
693
38394
103014
1984
36978
7775
21374
98402
13950
11248
13903
3439
670
36039
4945
26629
4021
4767
24681
260
86866
7201
15753
44030
1702
6466
50073
6419
3688
588
15037
164
31039
61790
3969
2985
40143
28554
25415
10290
19626
11299
947
21649
202765
10884
5735
4752
47191
11863
17818
2597
8155
12713
7589
85095
8867
95
28753
1858
71202
11043
11044
16250
11428
2780
3198
50240
29717
40397
12618
18034
69801
36367
6362
7097
22617
78985
56021
1816
1425
7480
1667
8828
16660
16181
39286
1507
334
38404
546
24147
45410
3539
5004
2184
10876
11985
2706
30675
9243
22895
18550
11060
48222
75972
110075
299
13192
24635
24585
44029
5393
14558
25148
15773
11107
2915
5418
28023
5531
5513
14228
1853
18882
19726
19822
10556
13347
11966
9586
34077
7755
5892
5893
5153
1993
13513
80416
3142
14390
12385
1807
12669
2115
9261
16808
45309
44309
25594
5577
148605
14579
22506
2064
646
59782
3049
40483
158
3332
16732
16475
1546
2360
23433
1530
7760
360
4590
14070
2385
11176
18268
33015
22273
4204
4411
504
3736
5278
6101
9927
47131
47387
28630
4616
14151
23115
4043
11890
6789
1818
9399
9437
10028
18173
3756
5684
3193
2521
79132
11576
55173
35037
4788
23717
26420
2146
27573
1156
7842
4762
40470
1491
12858
21129
9603
5459
5396
1479
15052
4820
169
9012
17693
1694
1618
10297
7714
1462
13504
25789
24939
3251
3093
48823
20334
28205
4698
23939
3249
7967
2986
3276
9744
3349
8911
2952
157
6554
2306
10950
6328
501
10025
59644
199476
8402
3041
3206
6920
13655
2531
2142
23039
333
36467
8648
3553
16282
47850
9381
25973
116050
7067
4986
14277
2961
21977
7093
12066
16786
9294
737
5467
11579
147
6461
1847
2273
3241
12121
19471
3286
2896
14480
13619
13620
7586
44476
11673
34851
8693
8513
88834
3482
3882
13334
2426
30843
4990
2777
22089
3845
14087
14084
25869
40713
3285
9053
11389
5075
5455
5359
16005
8286
21806
6918
3111
1740
51898
5873
4579
4452
2276
5736
136724
44888
5646
5269
1315
5208
16178
1122
428
46648
20517
2037
742
35520
31133
30012
19907
16804
7269
3911
7127
840
347
1329
15191
9100
5639
8389
5198
11900
1976
68240
1316
7164
3678
25958
19322
11956
3473
35469
31013
5461
5542
8488
5620
182604
12027
3498
3525
9218
56856
35187
36390
10530
12208
4703
7887
8159
15554
51417
23323
7220
1219
28519
5659
10426
44561
12791
23630
22727
17391
3996
5026
3939
4154
11159
4086
15260
1114
5291
1637
50684
22300
63184
698
4710
3230
4410
16575
11461
6497
2753
3113
302
676
615
21149
6818
3394
8119
1268
1551
4393
32823
88076
4950
461
4922
22545
86486
11639
13094
18753
3573
2427
7937
10440
63807
1429
3613
22048
54507
44503
5982
5567
2776
507
81
175
4966
20050
1707
576
18529
7925
8495
109814
13713
3370
24019
2689
11367
10222
49288
421
19368
25392
12989
1549
5752
8879
38006
24260
1734
10398
4072
12460
15139
8314
10684
2988
586
7717
8634
41895
19714
4143
4211
10323
7576
36397
18747
18191
18216
864
2145
14211
116230
7549
32613
4263
22819
36856
5979
19061
16709
4218
1271
6377
5121
12660
1049
42534
29860
45092
294741
4728
9124
5158
5193
3830
5663
16797
5976
12133
12135
5267
10295
1013
4897
31044
80341
1996
38713
5068
52030
19803
7230
10114
15093
5111
15439
27236
1803
1625
12260
12657
17183
15145
16218
40849
2031
6811
6769
19550
4171
15756
4360
2671
578
67314
43728
6954
2823
18225
5980
2441
17565
16690
5101
13054
3319
15113
2849
34653
9293
3082
40091
1645
22093
9665
1449
2068
8954
3998
59748
21360
3903
4840
15483
5059
3118
1132
16995
10181
25429
16612
12593
8305
1905
27224
6363
13737
556
987
25176
2431
372
52144
43085
45583
33860
19495
31436
23423
51539
39474
11416
2484
34539
2136
770
4122
6111
19241
26119
34138
33555
18262
4908
15847
170
3036
1125
20624
4048
7948
30269
1338
1153
11660
13048
21684
3918
10142
24055
35479
5988
810
14376
11563
3315
8219
12594
11438
10070
2285
11975
136741
96790
123380
11324
3263
8366
777
6140
11906
11907
1675
5628
22492
29692
3667
11879
8955
16864
3372
36066
4378
15584
5358
37633
6302
2463
2139
7179
15480
66786
5279
15759
10859
9254
4597
13729
6323
1477
23829
13298
5580
29122
4253
1692
5923
29504
18349
24579
8404
21031
47348
3169
35642
35643
35644
2841
83564
19484
82153
40821
1380
2010
1395
36332
12378
120902
174487
46824
4895
3744
9640
60563
15189
2032
6966
12094
9999
40423
242414
36454
740
23671
9724
45850
371
15245
34968
4626
26507
12592
6079
9256
650
4607
4604
6864
520
298
17120
5312
3487
5850
8906
9807
19489
30161
10661
25027
5456
2772
11100
16703
122404
40854
89446
1274
21460
2403
35581
5656
13092
26551
8892
3339
9452
66758
312783
3411
2956
16006
29106
23168
14132
4232
3698
11993
4349
7772
3320
17475
4972
14723
14571
25359
29704
47890
11447
14332
1726
17363
37873
2848
3434
7264
5740
3941
1772
1023
46294
14089
3359
1377
16697
113
16625
8519
5658
10042
5596
11167
29780
5013
11134
2875
18591
15446
239
6878
3598
25971
87748
16580
34733
9842
28247
9728
47809
11764
16083
3264
10268
23139
10926
54983
2092
10061
5598
9855
3065
21727
35921
49885
16821
18334
1883
16932
11571
7749
65294
6217
10985
3699
511
31915
29433
47308
61396
7043
5698
4987
63134
44579
10174
64274
45758
11155
48708
54380
17217
38646
8772
620
10475
14008
20680
51199
32724
28786
5475
5253
28279
2371
15660
2322
42362
1309
6129
10864
29058
18291
6593
9223
1157
17095
13721
17166
1217
15594
3908
8998
25586
29291
41765
63187
71513
1660
25972
9566
4563
7327
14284
1697
414
8263
5216
4099
18542
5311
5920
8380
142298
2614
11393
6063
135567
33320
5310
9154
1337
6438
62260
3965
272
32775
1513
114745
3114
12218
5686
199
18406
9645
384
13769
7033
6180
57268
17414
56212
8149
9530
18449
20221
1656
9373
34988
19589
23070
25835
21996
14577
10231
58243
10027
3096
37728
4634
4689
2339
4110
1171
49035
43654
3679
12060
16555
3278
10304
14396
76548
1034
19153
1963
48141
10668
23137
5697
9990
9604
1974
19507
1956
9088
5906
4739
4975
8125
6999
17184
9903
14894
10431
9126
22159
5862
20685
10366
46195
4408
1639
11118
5642
30245
8584
8982
30720
4258
55305
29131
1528
10676
8242
24870
38016
3953
44979
13837
28507
11738
65130
378
37963
7545
15038
1613
87914
7483
20260
3838
63954
9762
17702
23176
59
32537
7141
98585
16253
389
16008
29947
&
8160
80530
5189
6605
52740
1297
40677
20683
4117
2140
13103
1290
29316
3894
1553
6589
420
218
74948
4606
8416
6113
36372
14521
15281
6450
92209
1169
5811
12072
6395
17321
8842
711
10546
9488
6387
67444
14937
6853
4449
7227
25836
2623
49168
654
109209
7225
60364
6476
8697
17679
12584
8299
9549
25230
16295
10139
16099
32202
5458
423
1248
19830
18480
32952
25393
18400
5683
19266
2687
26970
17474
2679
13673
2907
13794
6254
9964
9697
15180
8973
3726
3378
634
44344
12986
37690
3925
37665
9027
5435
29139
4596
38676
19856
38436
73135
7454
2457
891
22374
542
3387
6629
335
5821
21914
362
11495
10443
2055
12840
408
39448
17690
10674
3204
12798
37527
49102
38034
6797
2904
17019
13743
17245
14904
14977
8666
13438
10433
1063
24848
3028
39688
3221
5385
47419
35462
51812
41625
“
36184
”
1084
5453
2466
2581
11772
4791
7232
3841
871
2150
33524
6514
36471
23122
23765
7703
3821
4741
9615
7509
11005
11411
33449
4095
101560
1962
37081
36745
3062
4138
5407
19192
10224
1254
46164
57245
6016
3611
11786
1835
10192
30847
36414
18973
3130
1892
11898
540
7313
8210
23125
23117
3851
28382
39346
32327
9180
3362
1448
59136
8868
5742
10599
6770
47787
6819
1499
10459
26579
4455
10601
7730
48345
48519
4621
24749
14570
3503
46541
51940
68453
7159
18420
31924
377
9819
1909
4254
4872
50294
10949
925
3402
3799
3294
17099
19741
1964
6926
42833
7632
62558
15053
14833
8934
13287
35409
22554
7800
22529
2020
4901
14204
18723
889
67711
27733
15418
15419
28561
5966
4394
5237
4447
960
25919
7385
30922
142
28560
96947
31353
10394
134323
28463
169118
4900
35487
5571
18084
3023
10301
7592
6203
19993
38501
2308
5516
11131
23253
5765
19914
23716
1605
13979
492
7927
34005
9986
8927
4885
27474
62718
3165
25268
6017
2997
28288
28598
321
5908
5190
5623
15833
67
6198
862
2909
12530
13604
2779
5298
10525
30354
29537
13826
19565
35802
6908
10731
6891
4196
32063
57
639
63864
34985
14573
58266
25838
3436
3178
5536
1541
2480
30567
1865
11544
21291
32379
15966
3774
6014
13204
8846
17828
169499
26262
292
67240
4420
38230
17701
27509
92153
712
14512
18782
11613
7865
11968
1686
7075
10107
7653
18200
7758
83506
10948
16887
10983
6553
13352
2240
4096
3115
69652
4135
3101
20357
2016
10810
5123
10129
4881
1127
11740
11778
1873
1204
1753
5719
25812
24144
24145
3601
127
2470
2793
16436
2832
2101
1943
35702
3624
35559
2610
329
5451
4550
3135
3397
65129
23802
12224
5874
1845
46672
1051
4041
20039
23758
82597
36519
6934
212
92969
40181
45067
1854
44326
10972
608
9571
5235
3977
71159
46011
17249
4077
3151
3763
12505
25005
12889
36142
5275
4268
1630
26948
2428
3764
1954
17188
1944
10516
3888
3720
9958
4477
18625
68388
92134
21164
2818
403
968
38717
7799
677
18698
20499
21635
6018
10154
10155
8540
27958
1759
3602
1634
4916
31345
9355
15561
11512
4939
6619
56387
67654
38556
2278
27404
48654
6117
62618
6288
1748
11566
3607
14271
4924
57072
23768
2419
13450
29552
3132
10342
24311
11000
59631
75091
55351
2113
8918
3194
76134
5702
19132
48749
20749
9006
5882
31238
2981
5063
18632
5450
10776
7274
9478
2639
4131
103452
8663
7547
11927
5281
6393
18688
17032
68490
8356
17351
17874
648
67417
11276
6931
11222
43427
3499
18481
3330
31616
79957
7040
16461
1638
36949
2478
2775
29260
4413
36690
3440
16078
20618
18821
3630
52686
2468
4952
42211
19521
25874
46602
4190
3935
11790
18930
547
2685
2588
1575
37661
17809
10305
14380
12501
33899
24642
17284
5137
68006
14912
4356
3201
6731
217
9899
54777
4008
57652
10370
7951
2178
62040
3124
2683
643
2975
73619
62063
396
23010
11567
1352
16235
14242
31556
35252
2630
30804
4855
47326
42620
27675
6905
8226
7270
17528
16977
19372
1185
6375
34426
24652
14857
6155
127006
14572
25313
5921
11062
1255
4996
60132
10353
64866
2259
4130
21505
13617
57598
33751
21070
1347
5694
2464
5630
53986
1691
2863
17117
6160
13561
20212
5974
1333
16511
40938
73241
4615
29070
103714
857
4849
4851
42492
17544
9335
6285
5238
22716
16934
2529
3938
48588
4920
35141
106255
22085
28708
201
35897
3031
63507
2272
27682
4225
12482
9291
6424
2869
1906
4067
17820
1615
63501
242660
5276
21645
42559
27073
3533
116376
46880
38800
7952
1229
66923
26409
53036
94970
14794
27887
127671
2586
43798
51723
192
3
8003
6519
3384
1480
12977
14076
2613
3970
4339
6208
35635
19005
14941
2052
18972
26401
11109
21781
9985
16095
46991
30172
5365
2968
5732
5127
7692
24248
3842
35235
1616
24054
23996
9978
10104
8870
9145
2017
2838
20662
40698
30381
5491
35028
94723
6429
594
41746
19434
81050
14068
3535
26890
48827
4369
3279
12911
28174
22829
11273
27425
11253
2717
2048
2499
7475
54331
6426
39482
27136
72392
9546
71733
11305
6206
36518
45250
43619
18086
10068
40376
2434
4680
25408
21095
6472
56523
29219
5078
3582
8333
35676
60381
25685
157169
45194
7066
13733
22110
10487
145
9517
22156
5604
2337
912
6860
9599
7146
9816
3597
3657
1427
82620
31642
18660
1628
4941
11228
779
13839
13871
21114
4543
6167
16629
53740
25223
135
23335
75947
35279
2748
4199
41447
526
20608
14492
9503
84964
4544
3775
26128
30608
67356
29074
44424
5830
2175
19759
17451
59770
72577
5617
1674
1921
14374
3604
17706
18643
13850
7926
18548
6494
13873
16907
41782
20270
5724
2342
3243
14399
23076
48837
2482
72456
6183
5360
29301
4197
43848
5609
14593
28196
6110
17254
17800
14878
31931
24986
1501
9846
4814
36132
134537
8537
11229
7247
44138
23635
21761
10209
19546
10960
57283
9067
2702
1335
29881
37976
37801
4391
47045
34314
8300
41333
3951
30065
2225
20691
4421
9449
13668
6549
266
12339
125180
32217
49957
2407
6297
150
33989
101615
9290
10419
6633
21165
4738
27081
6158
13715
16773
32679
23502
75281
6144
26276
16160
22715
88811
18378
1611
26817
24303
41937
1940
5768
12841
9796
27776
100178
115504
1079
18975
8838
43301
4014
3042
10752
9287
17942
3252
17618
28157
9233
273
3369
50447
7119
11721
33335
433
45898
136564
660
18774
29979
26115
1287
7727
16886
894
7636
1413
28793
44726
18798
21112
9069
94542
4804
48466
18149
52135
27403
7905
3005
15816
101802
18236
18237
1192
785
7532
8667
29007
14190
4681
19337
8658
1130
20560
23679
21115
4503
21828
108
3689
15892
33600
56642
42307
6975
14898
82799
26871
27617
19560
9642
26029
5442
1998
15071
49398
48768
4957
6915
15415
3270
63023
1321
345
5561
16685
94
28458
112197
21974
12467
57262
7406
38010
695
28312
24057
304
6191
23750
4111
7844
24539
1367
9650
33035
33298
10795
29765
21470
258
242
3561
11804
3363
55745
20604
982
3388
36453
101967
5517
731
19788
3638
12473
9428
1721
12879
6805
37612
22289
93819
18613
40733
82850
26245
5994
3074
8999
5077
4443
13970
6537
30244
1062
3511
53144
2861
13348
1103
1258
57109
448
22909
21186
9463
64828
54377
11406
715
14379
7268
12093
18854
50177
23451
289
2934
—
16439
3281
111986
15560
20204
4716
10227
19247
101992
15642
45004
7276
14020
13710
6332
812
17988
5866
2362
4230
54072
12529
5690
2332
10892
90869
18274
20752
6145
7683
13905
12523
4720
26516
571
17933
7147
4907
16501
10285
2265
13573
10628
1096
6746
9048
3192
28443
5662
14575
41242
69126
4888
4964
49325
49010
79382
4522
61923
34357
964
22882
28194
26074
36901
755
38528
54408
43451
15907
8365
5945
10019
14617
942
11039
27241
10600
93220
88936
431
12244
16159
7213
3157
3862
19250
12732
14345
21636
98291
28495
87135
26235
28322
33647
9483
6880
2288
29253
3267
15570
2009
32926
36920
8948
153056
22274
3408
8382
9637
626
5584
9763
13109
2190
18248
30373
208824
1773
33568
23203
17407
6443
54526
16753
3718
828
1019
17408
27845
4799
12648
82899
6185
20547
23147
6099
69435
5942
79380
24379
8162
31555
41397
18462
44590
158746
14356
23008
8508
1824
54
40036
22521
41701
6201
19608
25824
10577
6761
40280
7447
6496
9120
5909
30067
5647
55525
9096
18003
27642
1723
206
127312
63153
81739
6319
32946
59634
11313
43061
12335
20978
72929
37
5627
57778
55683
57472
91308
5062
21824
1703
135804
3860
19836
17699
8274
1833
5804
16203
21212
4341
7398
15517
23953
25258
8082
46326
9942
35651
55394
8170
2351
3754
2274
9453
4207
13557
8719
24987
33534
37334
16841
14287
25943
24671
15673
2836
13452
25449
23084
2763
24385
4137
36858
601
1534
1394
11507
8490
10199
3021
1131
3358
4944
42852
7953
23567
15481
5258
2363
7021
22267
6300
37466
45020
4750
23990
55784
14745
4558
8395
2236
25101
62693
552
1445
1939
2789
564
2317
6139
14310
55706
28057
714
20657
555
18953
20004
2203
19920
36557
17023
2851
17385
57027
13397
5616
79207
22388
20145
53748
27
4169
19130
25416
13380
38003
33155
16412
54246
7665
238
13190
5911
4183
29541
6471
15794
5277
13044
6187
3484
11396
71143
5433
18839
5633
35364
28496
15743
4519
13772
16209
51255
4150
56532
7504
39862
39863
74519
4042
12833
53766
12923
3186
17305
24558
58642
21531
65190
5503
11259
22118
29952
26698
18240
4547
2744
5946
39336
51224
14007
83368
8339
6350
62878
9965
18562
21299
3461
4123
8922
14974
818
2845
25441
4409
3900
45819
18367
16195
12880
7421
232
18258
13653
3790
2887
7635
10663
11267
63335
5323
12145
6231
17904
4959
36846
6271
41860
3798
13768
9164
3140
12587
12336
54362
50532
1306
9982
31346
31347
98631
45729
3185
8313
1579
2049
53088
61897
5973
4282
55213
7329
1231
2033
11535
17710
2183
48524
12124
21796
23858
14871
10585
24235
14444
10461
9981
5430
9367
14554
9592
4829
13253
20000
1601
31186
15391
4489
824
43013
624
4022
108493
8407
59779
23618
19043
19540
10853
6640
5673
5109
1867
26423
3250
8208
239558
17843
58407
11214
5302
8087
2556
10654
706
13333
10465
4679
12207
18183
22552
1366
43120
18580
66086
20969
29762
16923
337
18962
32328
4732
2011
22346
2544
22352
15394
2882
40522
87741
196568
62806
5747
6744
7895
91393
23473
15077
3134
1414
7923
19150
130184
31062
25511
54336
21383
68965
15153
44841
60063
7513
6072
27525
58795
2877
3126
13085
39872
52084
11430
30771
36082
21116
20605
64989
2143
56408
11397
635
38763
12200
4781
5629
2921
23204
8473
8027
30377
103077
916
1108
17496
6141
5492
8405
11199
18964
37613
20471
11704
33531
19665
9352
26122
11793
31129
7013
136705
8675
78553
18708
53075
20967
26125
14110
12315
12205
27542
662
27032
3441
9660
1975
2812
6796
19177
6073
14999
8762
19884
6049
11033
13738
44094
19075
23691
65625
13567
16832
26373
8442
2603
19911
100249
2297
12487
71389
2390
11489
39738
30805
17236
4206
12528
34991
57498
42512
128506
128504
931
27444
1379
23362
4271
6413
2874
16086
41929
1190
29464
220
54142
15067
24220
54068
9860
27740
4594
57138
9396
10423
3112
24386
51887
14011
20552
94328
61632
13912
23136
120
23384
6947
958
70409
7715
76469
26534
25912
4976
34385
34223
2283
27484
39155
30485
4256
42831
25644
13358
5464
2568
30563
14319
8758
3751
4015
20931
32131
5423
11150
1779
28354
10833
23952
9818
19033
9209
55092
17525
62317
2367
29879
12024
27121
23791
17688
21847
392
19782
6223
39110
799
4659
17616
38768
7639
107
66
55773
3702
29602
6239
4835
8916
24518
25645
3374
24519
62686
17956
6909
27918
37900
8778
36460
10314
43242
12983
41235
39325
19994
1498
4657
41163
27223
3807
22851
22836
29564
1936
213
4554
40535
14447
2120
33355
8991
2785
6449
32853
3046
12644
24687
40964
42034
1002
3163
6326
10315
16620
22175
13226
14257
20140
42240
10963
116955
17513
24973
44934
15719
14648
7431
34945
2374
2833
6584
58736
37188
33337
24027
3890
9159
9160
800
16240
3199
6879
179359
17575
4874
29528
529
23989
26693
18673
1239
27098
25074
133978
6983
10205
19986
13952
4706
14726
4496
30295
51036
27390
783
18805
11101
13928
7630
18919
14783
14419
3704
84022
37340
10429
19559
2053
25370
13635
9340
1817
3454
10924
10249
12048
2876
56820
3386
8877
10521
75275
30546
25405
16682
13222
5330
17053
2042
13476
26702
6204
87201
11645
42166
14776
2056
27128
8145
217205
6588
14693
6308
7282
14019
14836
25273
9214
13814
41439
20432
30818
13239
2692
35049
50811
27055
27335
352
23198
9789
6892
6077
6121
9865
16774
53850
36610
13409
2708
19355
4593
42441
3800
183837
1181
4109
10643
18408
35804
11592
18898
12572
37182
5315
391
1999
328339
9513
24991
724
69897
5246
36346
6830
56337
14580
18036
7474
27710
63544
476
17890
6715
17714
4863
21979
22678
25813
3961
993
1249
1025
24782
47221
224
15043
1506
8960
28384
13542
17281
121098
57324
22094
7591
29821
64
63304
3228
4641
6775
14637
3053
13167
6412
3880
2354
5767
4770
5549
2329
29773
67853
5215
14061
3515
3164
6506
115734
110189
4298
48593
5582
1926
28034
10805
323
10563
2090
21481
17951
11656
136729
5511
3641
7412
8005
19728
14623
198980
8989
24532
18347
3052
9902
10073
13146
2287
19391
26268
28508
25694
33078
23196
123193
21208
92647
109997
8591
58303
9557
5452
38050
13225
6228
13956
68173
26088
12370
34681
33074
53399
14865
24886
6795
22446
20173
7316
31246
1233
21983
1228
6857
8652
18372
8824
5065
28929
5807
3591
38794
19737
23308
24822
8028
14622
4870
2847
24091
5865
2134
2325
5715
32011
44879
61281
17518
2895
24093
5552
35100
45140
2316
47722
39843
61181
25389
29655
5186
15971
6399
35345
12957
1784
1785
11031
26411
2327
4106
8516
24900
27440
1403
4184
12437
34225
6917
618
44584
18273
19745
4264
224406
966
6942
26380
6856
4890
94903
1635
207
15815
50821
19650
11491
2672
35162
30277
4439
14167
22494
9436
8276
3373
3375
21346
12766
2514
18531
13688
4415
14256
22023
313
7986
29545
51271
10159
2452
1732
4876
9752
5547
19325
9857
14042
5443
9105
23219
24670
65639
3214
6084
42433
28871
12174
3409
1742
52408
40292
23021
5781
15569
11104
5076
3283
1837
1260
48770
52656
12153
93357
44808
16862
1210
5030
11725
9185
4108
47294
5699
65240
122582
10346
26667
15843
11896
24334
9536
43378
18661
355
12389
8917
5462
48835
13493
32637
12220
19287
80728
51478
7411
2855
8931
2267
16088
18447
10047
2925
8369
14200
9657
13822
48031
22632
3739
18165
23637
10561
9997
62948
22445
23888
8641
2539
4923
18727
31855
26053
25294
4309
9498
6283
12091
2804
43903
33978
13240
14338
7429
6371
16631
4766
12707
6473
16105
6607
5183
45201
25572
385
45804
50881
10226
111060
31400
31121
48610
1299
14209
39850
10650
15051
42667
13011
24713
11342
27143
10587
3556
4853
3297
14260
116793
38269
22710
4118
58843
8099
7279
721
41455
12818
15083
7346
3497
10385
23393
22568
6571
2408
10575
27703
8659
20344
8489
5990
9345
11744
32883
11607
2778
10031
3652
22160
6627
10094
7796
59026
34487
26966
60767
5176
12323
9944
42813
1609
14824
38306
4188
10754
4910
13618
36783
5937
57894
4054
26783
15371
40870
15632
1861
10549
31504
44118
80428
22719
27231
20337
17703
1431
43840
12086
6867
1277
5273
16346
8896
28736
62298
25263
40424
12577
9477
8688
4700
3866
18022
30732
75431
3309
6015
53472
21254
18694
5048
5816
9529
659
36758
36500
5527
38897
23163
23431
2177
10014
101
39737
4825
2939
1922
17018
18869
81104
12085
19817
49753
8180
9971
5016
3152
1441
59751
9454
658
537
24237
11161
73518
12331
12250
20696
15562
1418
6108
10573
62581
2782
25044
7658
12014
43306
16960
62267
54645
20697
36151
59086
19360
4365
14566
36938
51424
5710
7059
37683
54090
8396
19481
5602
4729
13803
2026
3235
59152
11736
13689
1246
19457
44187
22643
9249
11348
30802
30157
3629
729
11373
81088
16094
723
2626
67377
7428
40051
36060
3456
19780
19230
1373
4565
16164
18467
17089
27436
19900
111025
33988
8903
8493
42106
64658
56026
7386
25414
27416
4512
525
4613
12633
7154
10041
15267
17340
4267
4940
5701
30904
5669
3335
26001
6470
115745
6301
36625
90
14775
13549
9843
36737
93296
55732
21016
56517
56518
30779
9205
27178
39296
18423
6815
33990
41907
13284
9737
1150
1910
70971
19766
126737
9227
12101
29244
2964
9112
26954
3207
30313
10255
25690
6932
94309
8391
48886
11051
6436
2269
19864
19511
3085
7994
1320
2868
7614
2941
49996
11791
53128
6094
6660
26365
37402
62156
12451
4718
990
13295
94977
39182
146150
39031
2694
13895
5575
9996
3338
13073
36850
14800
6855
+
20772
4611
28361
25821
103529
28040
3246
66014
56819
409
4723
161808
1212
143316
3528
6859
6900
53236
101904
18119
17145
14296
20850
21722
13811
11355
69933
17764
15491
26474
7048
16079
5745
4297
54632
16964
8745
23306
12479
2410
76112
34118
31615
2077
7195
69324
6089
23997
7780
27466
56821
13819
11800
9162
1754
128534
14423
4838
4686
22297
103302
32241
47346
27307
7740
3518
28695
27312
4322
78178
41224
30101
48570
617
22910
25122
34523
41656
2266
20762
26408
4824
14366
22151
18909
5869
149800
14947
15055
36923
28124
21603
7217
70687
11177
9413
30388
23189
5419
10230
10173
10769
23674
9534
19941
4580
12837
17439
12831
3258
30509
6895
7173
6897
6289
36836
54608
489
21594
40193
6515
2119
8515
8092
17705
6585
30478
7356
560
6562
34912
42663
630
44710
61885
24024
28797
130273
10437
14688
1184
26310
13953
15443
1361
10849
52820
50749
5373
45133
726
16307
29527
33850
49250
13233
35266
35164
4502
16090
26257
5231
9267
5211
99
1981
12088
13603
34700
8707
4377
1531
5351
24213
10535
44303
6662
3452
7041
120320
1088
1890
55730
6171
63515
27572
5611
9989
112957
31272
38148
17728
47
2798
30184
827
5471
5601
11423
12715
43673
5218
35331
4374
47186
851
30027
10520
10379
5210
2108
51645
9401
23311
833
64064
3786
17182
12483
19418
43676
46785
18566
1912
68025
473
38083
25923
3474
2866
3103
40021
64013
59455
14538
33991
16949
23808
35935
41735
123799
58286
143447
5022
2541
33383
4712
57607
30634
33965
12105
1763
1263
1066
37473
17143
3245
7823
51794
11774
4116
28281
19419
14659
19070
15653
22051
13215
11775
7364
11754
9897
25569
6710
23440
2062
13290
13394
63595
3365
11333
17999
3549
5526
17317
6781
5223
16288
9523
51579
36631
28302
24414
35681
13327
70764
18538
33709
11515
9312
3366
25595
19700
36623
1657
28297
31595
60706
4521
34248
10229
3148
19361
37939
11475
9928
12985
19298
131023
5905
11195
28514
580
1453
36421
34675
53971
134259
21102
19978
5399
23945
3355
10646
5778
19025
75180
8730
16031
62739
24709
45078
83073
14954
71432
19503
1133
9079
28335
33566
18525
19483
10427
4927
28232
16283
19604
11928
14991
6634
32173
76987
10997
6528
7907
17946
14725
3237
11189
12102
86996
3356
8820
13977
13401
16303
8264
6747
641
22753
12619
9858
33187
1927
17008
31368
26963
6751
9915
14594
11823
1163
4668
5044
46790
12724
23845
2732
40447
19643
25194
24287
14496
52816
14515
14517
15828
53887
36352
301
7115
7713
43333
15427
9441
/
9
8386
18592
6798
12924
1848
3552
72595
4468
3368
27517
17721
30994
20540
14094
24493
29673
13472
17867
25859
17225
23629
14388
14647
45009
13276
13459
4992
3478
13010
74364
42892
39786
3502
3277
17320
38272
42227
9966
369
1032
514
713
12282
6227
167
5544
1629
1631
126713
38379
29533
59596
12802
9671
17482
203620
569
24955
20074
14710
4660
5448
11135
2493
52770
61463
10973
9593
38532
16578
10178
29799
2301
21408
28502
3026
7750
28785
41287
24014
6742
53660
24409
77878
21253
36157
16270
16329
26065
2099
19839
4376
33476
5900
25726
874
10052
37225
5354
19032
37626
134224
75976
19870
47972
78808
3095
30178
65248
7000
12409
17610
8882
19756
2061
9235
1435
4170
4112
844
47151
393
9492
13105
16380
27257
12430
1118
8151
24691
77789
20413
7963
10250
7904
9111
19332
109699
122467
23488
78783
50181
76868
18156
4480
57848
13662
1558
70345
55556
25188
18209
5706
4588
31936
6402
34738
18946
991
117714
1266
202153
20061
20066
59558
18797
9024
20230
14072
41871
2035
10122
17248
12006
54275
11680
16019
3570
88089
8067
24201
85222
5341
14717
2406
28416
77885
4598
5914
19121
10316
6320
18947
8642
62645
8502
59074
11138
78952
43646
65734
22816
25712
13043
94019
8703
51257
33952
18163
980
37297
541787
7403
11777
3094
1877
6625
1811
?!
9148
18404
12963
14616
72206
42190
2713
4398
9790
60380
19206
18133
19274
5833
2913
39299
6865
62680
25388
45413
11175
4918
59648
7290
60398
3804
20435
21078
3308
23598
400
13633
43910
6863
18595
34150
18703
119631
82839
5657
31366
1259
6334
41245
11346
19956
66297
3462
20363
56347
11901
3226
12123
1781
8334
24317
539
73063
85993
42719
48350
7993
46857
24711
11365
9451
1033
5846
11837
11012
13460
7448
25059
5043
40511
22130
34628
17579
17708
5725
6927
344642
14220
8485
4947
1121
10811
3971
67502
26205
24170
64627
88663
21122
33427
45786
6988
9641
31749
3643
15472
3783
5543
53786
25265
14660
21537
36733
38283
16466
6712
35318
62780
8223
48218
38363
60369
89943
28432
57005
9010
33331
19861
9624
8036
18286
2948
12416
11595
2116
10413
9370
56845
40529
9649
56475
9354
21034
43394
43747
3444
25284
54235
28873
12013
13921
8283
37045
4481
988
2819
2124
3514
3350
20371
9174
19104
80354
512
207769
45690
27541
2550
15018
36526
4692
17481
42442
35137
10000
11878
10990
1524
5589
273440
15328
14601
205111
5606
59473
15520
3404
11546
6991
6174
11530
25184
27996
33435
19002
2607
14266
18518
89003
39979
4535
16905
44490
28639
50598
45671
20068
70
126329
25776
13877
75024
26832
1419
88692
6750
21720
5947
17664
8907
3121
5271
3078
13553
39303
3755
8083
4482
2559
51047
38405
51712
9527
4639
38926
26398
147515
39090
21966
2670
46752
11067
8880
2604
2453
62549
4926
6446
24074
20896
3707
19367
22168
3410
6974
14784
4238
2926
16167
261584
20836
8910
15855
1433
405
5506
4094
10313
99129
39392
4367
22499
16134
3988
4652
54693
74792
40165
168427
28269
6993
17020
683
13829
1967
3820
8414
38514
605
9143
3019
3586
5152
12400
3507
3733
93583
17853
36176
23924
51810
9462
6635
20047
39839
28163
10110
7175
1311
3999
18829
11888
51375
30297
20630
9323
9324
36568
8959
11398
74559
11943
7521
6212
28223
23565
40805
12227
845
11244
2667
5953
25908
19563
21570
51697
46254
10615
50491
14127
34038
3520
77329
17275
5803
29897
4100
13637
4303
9139
30902
45901
5318
575
21445
4224
8625
9004
12699
©
23065
29638
20911
19492
3160
1454
21183
36180
24989
28566
7642
13067
14326
29174
2540
49967
5612
19533
85622
53688
12919
13272
9426
18733
675
61655
415
11669
8552
2730
3723
3038
35209
171
11610
15874
15698
19887
3701
37607
22307
32350
9263
29415
42518
42626
4693
7053
113265
9199
28696
19217
19218
13663
7215
11455
25443
3379
30031
10064
56220
18162
8732
23668
7004
25767
12379
34900
4173
20189
51566
7076
24097
24098
29718
14370
494886
17508
29920
17409
24094
18333
41749
32688
63170
105764
32923
16391
9302
7062
13205
5790
18238
25349
18019
9057
39107
56029
100774
7778
20294
25777
32495
3955
14913
4612
19491
110951
49633
110837
3290
12869
11377
20213
2395
17639
41217
34411
7602
12037
44102
22172
1799
11111
28629
17453
1593
24196
28672
14620
14436
6720
13925
8182
10150
64147
6579
10848
19661
49071
166501
25660
12197
10406
57859
5993
5754
9127
830
15259
38074
17663
29269
35879
51644
15511
13028
47028
14812
1095
45532
36466
39244
35852
2417
52228
16687
9539
6341
13208
11585
46410
6913
75599
59468
30001
@
7165
3512
17016
8464
17224
8565
15895
63486
3147
10248
4140
19076
4576
15054
26580
29735
18775
3376
6651
12795
11481
24767
61394
33393
18001
32480
11097
8423
34089
10981
26722
25448
20433
18614
69947
13490
27452
19214
19215
3202
6626
58348
4704
9307
23624
473563
12512
2982
13516
2595
24591
84812
17055
8977
35626
4743
8832
1484
2378
24653
85086
4451
24240
6898
5625
39548
8165
69332
13994
27311
6996
26744
9742
3856
51298
39760
23562
60431
13987
153
7299
19449
35455
41654
26674
8586
27087
27088
5192
25979
21925
2275
42293
30890
15582
6075
115906
12271
40602
42805
13138
3293
9157
1994
10325
79788
13473
18981
2963
31207
6342
4473
1308
7034
45181
58599
2242
15017
4783
808
9158
4649
126291
7325
13881
19156
14995
24090
2304
21982
77476
2917
4834
42476
702
63540
8209
187495
6953
28465
23104
6088
22396
47952
27836
64004
8358
27204
76006
3063
74679
40040
23394
6967
1330
64481
2545
3307
19057
10240
3219
25121
13848
13890
87865
838
12903
9874
15876
8671
2479
5824
41904
6134
8893
160383
2352
2006
28726
1769
24573
25435
42807
16210
2238
33473
17613
16648
282
13458
53357
65274
15840
105426
104362
52768
9250
11119
40889
1918
20722
10783
22994
7295
56900
9898
12929
36359
3079
148831
6965
45593
122972
61496
5141
6631
63381
4125
11086
19377
20399
12716
19092
56767
10085
11032
81544
28462
10726
22391
52542
25862
13483
1450
26849
78308
3993
12474
51813
17587
64674
37067
87853
1464
13723
50493
11658
20628
15968
17469
404
5904
29510
46292
37235
19146
19262
7716
16244
48509
35797
1494
33998
8613
1161
5853
23259
18886
110516
70956
107591
23661
3896
15236
29346
21718
36853
1221
9912
30528
57524
31679
19902
6115
43567
4414
13156
28506
134014
14509
36687
9321
6970
17137
23853
1119
54513
23237
21581
158699
20890
32810
16148
10802
68969
4775
37850
450
190
29839
197464
3392
6670
8981
2631
6595
10710
8963
11437
24038
9135
6862
9923
16657
24698
18123
37653
37654
37655
162856
18852
9416
10945
95514
9563
91731
15154
5481
11882
21748
4068
61226
12548
102305
19664
11069
120315
13773
59227
47044
63186
24581
56942
796
35451
29689
8628
5999
26776
8065
15097
145945
69132
13917
3921
8089
24858
8619
10034
2928
18049
43237
3029
11127
4387
40308
593
29654
16418
8850
41615
8912
4272
13274
171243
110016
10055
22689
26666
30450
74828
1497
5761
58816
6548
7935
18611
61888
18135
20445
3934
12796
69477
158833
10373
44014
9506
16568
17622
2527
24524
6599
28125
10220
12157
24760
7032
5177
108977
71805
213507
9286
20870
18812
9201
8004
2524
17986
13878
5535
6821
72380
4797
16097
100258
37292
11470
13806
18192
4209
14813
38349
218356
7841
36803
6007
73832
10306
4582
48572
10185
13685
50422
2197
1765
14024
10980
4894
16875
74018
43229
14861
5665
91477
20672
19528
17555
2650
21742
9359
15064
1783
4213
116173
90662
53972
62935
35392
14463
27530
33369
21650
3906
31431
18656
4091
152239
40375
40850
687
7793
94263
28818
17717
14588
65905
2949
32567
19359
20420
54409
19976
51195
11752
52347
10621
128570
40395
6661
17868
19532
51509
3858
15945
65794
16947
4444
34052
76177
56032
23322
27741
16726
9277
804
33385
28309
19995
43954
2870
20364
3853
97885
133253
12236
30361
55079
16877
201766
14290
117117
21452
46407
3220
20442
32931
54580
46257
27090
29891
23579
21605
16242
1008
82959
879
4383
56076
127849
6343
3310
12265
50775
6125
14478
13967
12127
3978
75977
16259
109946
9929
29176
52168
47745
24156
24569
7368
9651
14951
58859
6847
69732
129113
74494
74439
6883
5928
3017
27340
33660
138429
19040
1619
4902
36067
15182
3747
63576
47654
79535
87650
12098
2800
108497
105937
5812
5197
159384
36140
23591
57348
41049
13312
32195
7204
13430
6175
3672
11573
13223
5743
79124
25974
96278
14432
47646
52506
2534
26897
16585
171383
60910
20191
128337
5613
37175
9908
58023
25684
35434
9621
2000
6104
989
11554
19747
5962
33117
2135
181314
43643
4214
37825
56082
17259
6178
7110
4166
29117
25173
48877
28474
20196
4029
32558
15826
26290
19959
75589
13634
23194
9957
11970
75438
324
34308
38461
27233
3508
17523
13244
20977
17431
40811
3433
78782
88892
33976
162557
17830
6982
11431
13556
1216
12835
898
42457
358
65367
18024
1452
22891
41747
2349
12873
12383
55400
135571
41088
29547
3313
32519
34178
25356
5557
37486
581
63639
1241
14587
3161
15461
6555
110847
9758
60109
11693
6467
2083
7849
10854
709
14773
9136
149029
54022
13771
14373
23078
5167
37168
56862
24944
22387
28848
18415
31084
10076
10077
4627
45028
1483
7466
20649
30046
82538
40552
54076
52310
18125
293890
4450
34703
21071
2707
21441
7266
151298
10645
3770
7167
3703
46588
46566
168319
42525
9774
81951
8651
35018
29443
156600
7486
148646
13106
56822
5232
3768
9888
55725
61672
27274
1147
18090
4905
743
1289
17963
19640
20003
13802
37252
150361
999
19772
7837
12325
56137
14002
188795
139579
26126
21098
19246
3681
4818
27518
27316
19216
15962
82720
175434
56235
3059
24658
2444
203
22497
6224
22707
8679
15462
33122
28794
31421
7287
47122
26902
30105
11185
19479
31311
46285
265
5292
18807
36349
19568
23015
40221
1588
113264
11550
39170
8259
6969
23647
16919
110469
11940
1142
6507
6225
8492
34294
18368
5997
37363
24845
27982
23346
13479
20063
6054
10253
25715
88290
158892
91814
29296
35518
8769
3260
13237
7566
26951
22371
11386
22657
5092
28419
1560
23131
4313
78493
151
45762
2858
48533
9583
7462
13578
17240
18188
18196
65789
12261
12885
2676
11207
91181
33461
29194
13706
8953
73830
20976
9518
6989
19349
9939
30996
38439
11710
25231
36703
35736
60501
18926
17698
115
2024
17504
8338
11983
69335
22284
217535
11366
52842
20057
9191
24756
4189
19351
4071
33267
40407
9814
8158
12452
175043
32136
8355
11817
2333
20687
34154
6128
1896
10857
14360
7840
15318
5579
8213
19662
9176
13638
42517
95884
123408
128389
91168
18494
18485
9035
21924
39573
34389
11205
19717
76204
16073
23153
47968
53883
29902
11533
8972
32305
22853
19951
42929
8698
116872
34921
66801
55160
5073
52155
37307
26900
36533
121534
13810
2313
1623
20711
16396
71293
11785
78712
198467
11630
19462
18012
19440
14493
60348
4400
36611
16285
16241
1705
8914
5102
36843
36420
14690
6253
9864
37743
954
16790
46213
25333
30702
34239
55852
